[Killed] BlockStatement
Trybe/sd-06-project-react-testing-library/src/App.js:22:37
 import './App.css';
 
 class App extends Component {
-  static setIsPokemonFavoriteById() {
-    const favoritePokemonIds = readFavoritePokemonIds();
-    const isPokemonFavorite = pokemons.reduce((acc, pokemon) => {
-      acc[pokemon.id] = favoritePokemonIds.includes(pokemon.id);
-      return acc;
-    }, {});
-
-    return isPokemonFavorite;
-  }
+  static setIsPokemonFavoriteById() {}
 
   constructor(props) {

[Killed] BlockStatement
Trybe/sd-06-project-react-testing-library/src/App.js:24:65
 class App extends Component {
   static setIsPokemonFavoriteById() {
     const favoritePokemonIds = readFavoritePokemonIds();
-    const isPokemonFavorite = pokemons.reduce((acc, pokemon) => {
-      acc[pokemon.id] = favoritePokemonIds.includes(pokemon.id);
-      return acc;
-    }, {});
+    const isPokemonFavorite = pokemons.reduce((acc, pokemon) => {}, {});
 
     return isPokemonFavorite;

[Killed] BlockStatement
Trybe/sd-06-project-react-testing-library/src/App.js:32:22
     return isPokemonFavorite;
   }
 
-  constructor(props) {
-    super(props);
-    this.state = { isPokemonFavoriteById: App.setIsPokemonFavoriteById() };
-  }
+  constructor(props) {}
 
   onUpdateFavoritePokemons(pokemonId, isFavorite) {

[Survived] BlockStatement
Trybe/sd-06-project-react-testing-library/src/App.js:37:51
     this.state = { isPokemonFavoriteById: App.setIsPokemonFavoriteById() };
   }
 
-  onUpdateFavoritePokemons(pokemonId, isFavorite) {
-    updateFavoritePokemons(pokemonId, isFavorite);
-
-    this.setState(({ isPokemonFavoriteById: App.setIsPokemonFavoriteById() }));
-  }
+  onUpdateFavoritePokemons(pokemonId, isFavorite) {}
 
   renderPokedex() {

[Survived] ObjectLiteral
Trybe/sd-06-project-react-testing-library/src/App.js:40:20
   onUpdateFavoritePokemons(pokemonId, isFavorite) {
     updateFavoritePokemons(pokemonId, isFavorite);
 
-    this.setState(({ isPokemonFavoriteById: App.setIsPokemonFavoriteById() }));
+    this.setState(({}));
   }
 

[Survived] BlockStatement
Trybe/sd-06-project-react-testing-library/src/App.js:43:19
     this.setState(({ isPokemonFavoriteById: App.setIsPokemonFavoriteById() }));
   }
 
-  renderPokedex() {
-    const { isPokemonFavoriteById } = this.state;
-
-    return (
-      <Pokedex
-        pokemons={ pokemons }
-        isPokemonFavoriteById={ isPokemonFavoriteById }
-      />
-    );
-  }
+  renderPokedex() {}
 
   renderPokemonDetails(match) {

[Survived] BlockStatement
Trybe/sd-06-project-react-testing-library/src/App.js:54:31
     );
   }
 
-  renderPokemonDetails(match) {
-    const { isPokemonFavoriteById } = this.state;
-
-    return (
-      <PokemonDetails
-        isPokemonFavoriteById={ isPokemonFavoriteById }
-        match={ match }
-        pokemons={ pokemons }
-        onUpdateFavoritePokemons={ (pokemonId, isFavorite) => (
-          this.onUpdateFavoritePokemons(pokemonId, isFavorite)
-        ) }
-      />
-    );
-  }
+  renderPokemonDetails(match) {}
 
   renderRoutes() {

[Survived] ArrowFunction
Trybe/sd-06-project-react-testing-library/src/App.js:62:36
         isPokemonFavoriteById={ isPokemonFavoriteById }
         match={ match }
         pokemons={ pokemons }
-        onUpdateFavoritePokemons={ (pokemonId, isFavorite) => (
-          this.onUpdateFavoritePokemons(pokemonId, isFavorite)
-        ) }
+        onUpdateFavoritePokemons={ () => undefined }
       />
     );

[Killed] BlockStatement
Trybe/sd-06-project-react-testing-library/src/App.js:69:18
     );
   }
 
-  renderRoutes() {
-    const { isPokemonFavoriteById } = this.state;
-    const favoritePokemons = pokemons.filter(({ id }) => isPokemonFavoriteById[id]);
-
-    return (
-      <Switch>
-        <Route
-          exact
-          path="/"
-          render={ ({ match }) => this.renderPokedex(match) }
-        />
-        <Route
-          path="/pokemons/:id"
-          render={ ({ match }) => this.renderPokemonDetails(match) }
-        />
-        <Route
-          path="/favorites"
-          render={ () => <FavoritePokemons pokemons={ favoritePokemons } /> }
-        />
-        <Route path="/about" component={ About } />
-        <Route component={ NotFound } />
-      </Switch>
-    );
-  }
+  renderRoutes() {}
 
   render() {

[Survived] ArrowFunction
Trybe/sd-06-project-react-testing-library/src/App.js:71:46
 
   renderRoutes() {
     const { isPokemonFavoriteById } = this.state;
-    const favoritePokemons = pokemons.filter(({ id }) => isPokemonFavoriteById[id]);
+    const favoritePokemons = pokemons.filter(() => undefined);
 
     return (

[Survived] ArrowFunction
Trybe/sd-06-project-react-testing-library/src/App.js:78:20
         <Route
           exact
           path="/"
-          render={ ({ match }) => this.renderPokedex(match) }
+          render={ () => undefined }
         />
         <Route

[Survived] ArrowFunction
Trybe/sd-06-project-react-testing-library/src/App.js:82:20
         />
         <Route
           path="/pokemons/:id"
-          render={ ({ match }) => this.renderPokemonDetails(match) }
+          render={ () => undefined }
         />
         <Route

[Survived] ArrowFunction
Trybe/sd-06-project-react-testing-library/src/App.js:86:20
         />
         <Route
           path="/favorites"
-          render={ () => <FavoritePokemons pokemons={ favoritePokemons } /> }
+          render={ () => undefined }
         />
         <Route path="/about" component={ About } />

[Killed] BlockStatement
Trybe/sd-06-project-react-testing-library/src/App.js:94:12
     );
   }
 
-  render() {
-    return (
-      <div className="App">
-        <h1>Pokédex</h1>
-        <nav>
-          <Link className="link" to="/">Home</Link>
-          <Link className="link" to="/about">About</Link>
-          <Link className="link" to="/favorites">Favorite Pokémons</Link>
-        </nav>
-        {this.renderRoutes()}
-      </div>
-    );
-  }
+  render() {}
 }
 
