[Killed] ArrowFunction
sd-06-project-react-testing-library/src/components/Button.js:6:16
 
 import './button.css';
 
-const Button = ({
-  className,
-  children,
-  disabled,
-  onClick,
-  dataTestId,
-}) => (
-  <button
-    onClick={ onClick }
-    className={ `button-text ${className}` }
-    disabled={ disabled }
-    data-testid={ dataTestId }
-    type="button"
-  >
-    {children}
-  </button>
-);
+const Button = () => undefined;
 
 Button.propTypes = {

[Survived] StringLiteral
sd-06-project-react-testing-library/src/components/Button.js:15:17
 }) => (
   <button
     onClick={ onClick }
-    className={ `button-text ${className}` }
+    className={ "" }
     disabled={ disabled }
     data-testid={ dataTestId }

[Survived] BooleanLiteral
sd-06-project-react-testing-library/src/components/Button.js:35:13
 Button.defaultProps = {
   children: null,
   className: '',
-  disabled: false,
+  disabled: true,
   dataTestId: '',
 };

[Survived] StringLiteral
sd-06-project-react-testing-library/src/components/Button.js:36:15
   children: null,
   className: '',
   disabled: false,
-  dataTestId: '',
+  dataTestId: "Stryker was here!",
 };
 
