[Survived] BlockStatement
sd-06-project-react-testing-library/src/components/FavoritePokemons.js:12:21
 const ZERO = 0;
 
 class FavoritePokemons extends React.Component {
-  static notFound() {
-    return (
-      <div>
-        <p>No favorite pokemon found</p>
-      </div>
-    );
-  }
+  static notFound() {}
 
   static renderFavoritePokemon(pokemon) {

[Survived] BlockStatement
sd-06-project-react-testing-library/src/components/FavoritePokemons.js:20:41
     );
   }
 
-  static renderFavoritePokemon(pokemon) {
-    return (
-      <div key={ pokemon.id } className="favorite-pokemon">
-        <Pokemon pokemon={ pokemon } isFavorite />
-      </div>
-    );
-  }
+  static renderFavoritePokemon(pokemon) {}
 
   renderFavoritePokemons() {

[Survived] BlockStatement
sd-06-project-react-testing-library/src/components/FavoritePokemons.js:28:28
     );
   }
 
-  renderFavoritePokemons() {
-    const { pokemons } = this.props;
-    const { renderFavoritePokemon } = FavoritePokemons;
-
-    return (
-      <div className="favorite-pokemons">
-        {pokemons.map((pokemon) => renderFavoritePokemon(pokemon))}
-      </div>
-    );
-  }
+  renderFavoritePokemons() {}
 
   render() {

[Survived] ArrowFunction
sd-06-project-react-testing-library/src/components/FavoritePokemons.js:34:23
 
     return (
       <div className="favorite-pokemons">
-        {pokemons.map((pokemon) => renderFavoritePokemon(pokemon))}
+        {pokemons.map(() => undefined)}
       </div>
     );

[Killed] BlockStatement
sd-06-project-react-testing-library/src/components/FavoritePokemons.js:39:12
     );
   }
 
-  render() {
-    const { notFound } = FavoritePokemons;
-    const { pokemons } = this.props;
-    const isEmpty = pokemons.length === ZERO;
-
-    return (
-      <div>
-        <h2> Favorite pokémons </h2>
-        {isEmpty ? notFound() : this.renderFavoritePokemons()}
-      </div>
-    );
-  }
+  render() {}
 }
 

[Survived] ConditionalExpression
sd-06-project-react-testing-library/src/components/FavoritePokemons.js:42:21
   render() {
     const { notFound } = FavoritePokemons;
     const { pokemons } = this.props;
-    const isEmpty = pokemons.length === ZERO;
+    const isEmpty = true;
 
     return (

[Survived] EqualityOperator
sd-06-project-react-testing-library/src/components/FavoritePokemons.js:42:21
   render() {
     const { notFound } = FavoritePokemons;
     const { pokemons } = this.props;
-    const isEmpty = pokemons.length === ZERO;
+    const isEmpty = pokemons.length !== ZERO;
 
     return (

[Survived] ObjectLiteral
sd-06-project-react-testing-library/src/components/FavoritePokemons.js:57:33
   pokemons: PropTypes.arrayOf(pokemonType.isRequired),
 };
 
-FavoritePokemons.defaultProps = {
-  pokemons: [],
-};
+FavoritePokemons.defaultProps = {};
 
 export default FavoritePokemons;
