[Killed] BlockStatement
sd-06-project-react-testing-library/src/components/Pokedex.js:10:22
 import './pokedex.css';
 
 class Pokedex extends React.Component {
-  constructor(props) {
-    super(props);
-    this.state = { pokemonIndex: 0, filteredType: 'all' };
-  }
+  constructor(props) {}
 
   filterPokemons(filteredType) {

[Survived] BlockStatement
sd-06-project-react-testing-library/src/components/Pokedex.js:15:32
     this.state = { pokemonIndex: 0, filteredType: 'all' };
   }
 
-  filterPokemons(filteredType) {
-    this.setState({ filteredType, pokemonIndex: 0 });
-  }
+  filterPokemons(filteredType) {}
 
   nextPokemon(numberOfPokemons) {

[Survived] BlockStatement
sd-06-project-react-testing-library/src/components/Pokedex.js:19:33
     this.setState({ filteredType, pokemonIndex: 0 });
   }
 
-  nextPokemon(numberOfPokemons) {
-    this.setState((state) => (
-      { pokemonIndex: (state.pokemonIndex + 1) % numberOfPokemons }
-    ));
-  }
+  nextPokemon(numberOfPokemons) {}
 
   fetchFilteredPokemons() {

[Survived] ArrowFunction
sd-06-project-react-testing-library/src/components/Pokedex.js:20:19
   }
 
   nextPokemon(numberOfPokemons) {
-    this.setState((state) => (
-      { pokemonIndex: (state.pokemonIndex + 1) % numberOfPokemons }
-    ));
+    this.setState(() => undefined);
   }
 

[Survived] ArithmeticOperator
sd-06-project-react-testing-library/src/components/Pokedex.js:21:24
 
   nextPokemon(numberOfPokemons) {
     this.setState((state) => (
-      { pokemonIndex: (state.pokemonIndex + 1) % numberOfPokemons }
+      { pokemonIndex: (state.pokemonIndex - 1) % numberOfPokemons }
     ));
   }

[Survived] ArithmeticOperator
sd-06-project-react-testing-library/src/components/Pokedex.js:21:23
 
   nextPokemon(numberOfPokemons) {
     this.setState((state) => (
-      { pokemonIndex: (state.pokemonIndex + 1) % numberOfPokemons }
+      { pokemonIndex: (state.pokemonIndex + 1) * numberOfPokemons }
     ));
   }

[Killed] BlockStatement
sd-06-project-react-testing-library/src/components/Pokedex.js:25:27
     ));
   }
 
-  fetchFilteredPokemons() {
-    const { pokemons } = this.props;
-    const { filteredType } = this.state;
-
-    return pokemons.filter((pokemon) => {
-      if (filteredType === 'all') return true;
-      return pokemon.type === filteredType;
-    });
-  }
+  fetchFilteredPokemons() {}
 
   fetchPokemonTypes() {

[Killed] BlockStatement
sd-06-project-react-testing-library/src/components/Pokedex.js:29:41
     const { pokemons } = this.props;
     const { filteredType } = this.state;
 
-    return pokemons.filter((pokemon) => {
-      if (filteredType === 'all') return true;
-      return pokemon.type === filteredType;
-    });
+    return pokemons.filter((pokemon) => {});
   }
 

[Killed] ConditionalExpression
sd-06-project-react-testing-library/src/components/Pokedex.js:30:11
     const { filteredType } = this.state;
 
     return pokemons.filter((pokemon) => {
-      if (filteredType === 'all') return true;
+      if (false) return true;
       return pokemon.type === filteredType;
     });

[Killed] BooleanLiteral
sd-06-project-react-testing-library/src/components/Pokedex.js:30:42
     const { filteredType } = this.state;
 
     return pokemons.filter((pokemon) => {
-      if (filteredType === 'all') return true;
+      if (filteredType === 'all') return false;
       return pokemon.type === filteredType;
     });

[Survived] ConditionalExpression
sd-06-project-react-testing-library/src/components/Pokedex.js:31:14
 
     return pokemons.filter((pokemon) => {
       if (filteredType === 'all') return true;
-      return pokemon.type === filteredType;
+      return false;
     });
   }

[Survived] ConditionalExpression
sd-06-project-react-testing-library/src/components/Pokedex.js:31:14
 
     return pokemons.filter((pokemon) => {
       if (filteredType === 'all') return true;
-      return pokemon.type === filteredType;
+      return true;
     });
   }

[Killed] BlockStatement
sd-06-project-react-testing-library/src/components/Pokedex.js:35:23
     });
   }
 
-  fetchPokemonTypes() {
-    const { pokemons } = this.props;
-
-    return [...new Set(pokemons.reduce((types, { type }) => [...types, type], []))];
-  }
+  fetchPokemonTypes() {}
 
   renderPokemonButtonsPanel() {

[Survived] ArrowFunction
sd-06-project-react-testing-library/src/components/Pokedex.js:38:40
   fetchPokemonTypes() {
     const { pokemons } = this.props;
 
-    return [...new Set(pokemons.reduce((types, { type }) => [...types, type], []))];
+    return [...new Set(pokemons.reduce(() => undefined, []))];
   }
 

[Survived] BlockStatement
sd-06-project-react-testing-library/src/components/Pokedex.js:41:31
     return [...new Set(pokemons.reduce((types, { type }) => [...types, type], []))];
   }
 
-  renderPokemonButtonsPanel() {
-    const pokemonTypes = this.fetchPokemonTypes();
-
-    return (
-      <div className="pokedex-buttons-panel">
-        <Button
-          onClick={ () => this.filterPokemons('all') }
-          className="filter-button"
-        >
-          All
-        </Button>
-        {pokemonTypes.map((type) => (
-          <Button
-            dataTestId="pokemon-type-button"
-            key={ type }
-            onClick={ () => this.filterPokemons(type) }
-            className="filter-button"
-          >
-            {`${type}`}
-          </Button>
-        ))}
-      </div>
-    );
-  }
+  renderPokemonButtonsPanel() {}
 
   render() {

[Survived] ArrowFunction
sd-06-project-react-testing-library/src/components/Pokedex.js:47:21
     return (
       <div className="pokedex-buttons-panel">
         <Button
-          onClick={ () => this.filterPokemons('all') }
+          onClick={ () => undefined }
           className="filter-button"
         >

[Survived] ArrowFunction
sd-06-project-react-testing-library/src/components/Pokedex.js:52:27
         >
           All
         </Button>
-        {pokemonTypes.map((type) => (
-          <Button
-            dataTestId="pokemon-type-button"
-            key={ type }
-            onClick={ () => this.filterPokemons(type) }
-            className="filter-button"
-          >
-            {`${type}`}
-          </Button>
-        ))}
+        {pokemonTypes.map(() => undefined)}
       </div>
     );

[Survived] ArrowFunction
sd-06-project-react-testing-library/src/components/Pokedex.js:56:23
           <Button
             dataTestId="pokemon-type-button"
             key={ type }
-            onClick={ () => this.filterPokemons(type) }
+            onClick={ () => undefined }
             className="filter-button"
           >

[Killed] BlockStatement
sd-06-project-react-testing-library/src/components/Pokedex.js:66:12
     );
   }
 
-  render() {
-    const { isPokemonFavoriteById } = this.props;
-    const filteredPokemons = this.fetchFilteredPokemons();
-    const { pokemonIndex } = this.state;
-    const pokemon = filteredPokemons[pokemonIndex];
-
-    return (
-      <div className="pokedex">
-        <h2>Encountered pokémons</h2>
-        <Pokemon
-          pokemon={ pokemon }
-          isFavorite={ isPokemonFavoriteById[pokemon.id] }
-        />
-        {this.renderPokemonButtonsPanel()}
-        <Button
-          dataTestId="next-pokemon"
-          className="pokedex-button"
-          onClick={ () => this.nextPokemon(filteredPokemons.length) }
-          disabled={ filteredPokemons.length <= 1 }
-        >
-          Próximo pokémon
-        </Button>
-      </div>
-    );
-  }
+  render() {}
 }
 

[Survived] ArrowFunction
sd-06-project-react-testing-library/src/components/Pokedex.js:83:21
         <Button
           dataTestId="next-pokemon"
           className="pokedex-button"
-          onClick={ () => this.nextPokemon(filteredPokemons.length) }
+          onClick={ () => undefined }
           disabled={ filteredPokemons.length <= 1 }
         >

[Survived] EqualityOperator
sd-06-project-react-testing-library/src/components/Pokedex.js:84:22
           dataTestId="next-pokemon"
           className="pokedex-button"
           onClick={ () => this.nextPokemon(filteredPokemons.length) }
-          disabled={ filteredPokemons.length <= 1 }
+          disabled={ filteredPokemons.length < 1 }
         >
           Próximo pokémon

[Survived] EqualityOperator
sd-06-project-react-testing-library/src/components/Pokedex.js:84:22
           dataTestId="next-pokemon"
           className="pokedex-button"
           onClick={ () => this.nextPokemon(filteredPokemons.length) }
-          disabled={ filteredPokemons.length <= 1 }
+          disabled={ filteredPokemons.length > 1 }
         >
           Próximo pokémon

[Survived] ObjectLiteral
sd-06-project-react-testing-library/src/components/Pokedex.js:93:21
   }
 }
 
-Pokedex.propTypes = {
-  isPokemonFavoriteById: isPokemonFavoriteByIdType.isRequired,
-  pokemons: PropTypes.arrayOf(pokemonType.isRequired).isRequired,
-};
+Pokedex.propTypes = {};
 
 export default Pokedex;
