[Killed] BlockStatement
sd-06-project-react-testing-library/src/components/Pokemon.js:9:63
 
 import './pokemon.css';
 
-const Pokemon = ({ pokemon, showDetailsLink, isFavorite }) => {
-  const { averageWeight, id, image, name, type } = pokemon;
-  const { measurementUnit, value } = averageWeight;
-
-  return (
-    <div className="pokemon">
-      <div className="pokemon-overview">
-        <p data-testid="pokemon-name">{`${name}`}</p>
-        <p data-testid="pokemonType">{`${type}`}</p>
-        <p data-testid="pokemon-weight">
-          {`Average weight: ${value} ${measurementUnit}`}
-        </p>
-        {showDetailsLink && <Link to={ `pokemons/${id}` }>More details</Link>}
-      </div>
-      <img src={ `${image}` } alt={ `${name} sprite` } />
-      {isFavorite && (
-        <img
-          className="favorite-icon"
-          src="/star-icon.svg"
-          alt={ `${name} is marked as favorite` }
-        />
-      )}
-    </div>
-  );
-};
+const Pokemon = ({ pokemon, showDetailsLink, isFavorite }) => {};
 
 Pokemon.propTypes = {

[Survived] StringLiteral
sd-06-project-react-testing-library/src/components/Pokemon.js:17:39
     <div className="pokemon">
       <div className="pokemon-overview">
         <p data-testid="pokemon-name">{`${name}`}</p>
-        <p data-testid="pokemonType">{`${type}`}</p>
+        <p data-testid="pokemonType">{""}</p>
         <p data-testid="pokemon-weight">
           {`Average weight: ${value} ${measurementUnit}`}

[Survived] StringLiteral
sd-06-project-react-testing-library/src/components/Pokemon.js:19:12
         <p data-testid="pokemon-name">{`${name}`}</p>
         <p data-testid="pokemonType">{`${type}`}</p>
         <p data-testid="pokemon-weight">
-          {`Average weight: ${value} ${measurementUnit}`}
+          {""}
         </p>
         {showDetailsLink && <Link to={ `pokemons/${id}` }>More details</Link>}

[Survived] ConditionalExpression
sd-06-project-react-testing-library/src/components/Pokemon.js:21:10
         <p data-testid="pokemon-weight">
           {`Average weight: ${value} ${measurementUnit}`}
         </p>
-        {showDetailsLink && <Link to={ `pokemons/${id}` }>More details</Link>}
+        {true}
       </div>
       <img src={ `${image}` } alt={ `${name} sprite` } />

[Survived] LogicalOperator
sd-06-project-react-testing-library/src/components/Pokemon.js:21:10
         <p data-testid="pokemon-weight">
           {`Average weight: ${value} ${measurementUnit}`}
         </p>
-        {showDetailsLink && <Link to={ `pokemons/${id}` }>More details</Link>}
+        {showDetailsLink || <Link to={`pokemons/${id}`}>More details</Link>}
       </div>
       <img src={ `${image}` } alt={ `${name} sprite` } />

[Survived] LogicalOperator
sd-06-project-react-testing-library/src/components/Pokemon.js:24:8
         {showDetailsLink && <Link to={ `pokemons/${id}` }>More details</Link>}
       </div>
       <img src={ `${image}` } alt={ `${name} sprite` } />
-      {isFavorite && (
-        <img
-          className="favorite-icon"
-          src="/star-icon.svg"
-          alt={ `${name} is marked as favorite` }
-        />
-      )}
+      {isFavorite || <img className="favorite-icon" src="/star-icon.svg" alt={`${name} is marked as favorite`} />}
     </div>
   );

[Survived] ConditionalExpression
sd-06-project-react-testing-library/src/components/Pokemon.js:24:8
         {showDetailsLink && <Link to={ `pokemons/${id}` }>More details</Link>}
       </div>
       <img src={ `${image}` } alt={ `${name} sprite` } />
-      {isFavorite && (
-        <img
-          className="favorite-icon"
-          src="/star-icon.svg"
-          alt={ `${name} is marked as favorite` }
-        />
-      )}
+      {true}
     </div>
   );

[Survived] BooleanLiteral
sd-06-project-react-testing-library/src/components/Pokemon.js:42:20
 };
 
 Pokemon.defaultProps = {
-  showDetailsLink: true,
+  showDetailsLink: false,
 };
 
