[Survived] BlockStatement
sd-06-project-react-testing-library/src/components/PokemonDetails.js:10:43
 import './pokemon-details.css';
 
 class PokemonDetails extends React.Component {
-  static renderHabitat({ foundAt, name }) {
-    return (
-      <section>
-        <h2>{`Game Locations of ${name}`}</h2>
-        <div className="pokemon-habitat">
-          {foundAt.map(({ location, map }) => (
-            <div key={ location }>
-              <img src={ `${map}` } alt={ `${name} location` } />
-              <p><em>{location}</em></p>
-            </div>
-          ))}
-        </div>
-      </section>
-    );
-  }
+  static renderHabitat({ foundAt, name }) {}
 
   static renderSummary({ summary }) {

[Survived] StringLiteral
sd-06-project-react-testing-library/src/components/PokemonDetails.js:13:14
   static renderHabitat({ foundAt, name }) {
     return (
       <section>
-        <h2>{`Game Locations of ${name}`}</h2>
+        <h2>{""}</h2>
         <div className="pokemon-habitat">
           {foundAt.map(({ location, map }) => (

[Survived] StringLiteral
sd-06-project-react-testing-library/src/components/PokemonDetails.js:17:26
         <div className="pokemon-habitat">
           {foundAt.map(({ location, map }) => (
             <div key={ location }>
-              <img src={ `${map}` } alt={ `${name} location` } />
+              <img src={ "" } alt={ `${name} location` } />
               <p><em>{location}</em></p>
             </div>

[Survived] BlockStatement
sd-06-project-react-testing-library/src/components/PokemonDetails.js:26:37
     );
   }
 
-  static renderSummary({ summary }) {
-    return (
-      <section>
-        <h2>
-          {' '}
-          Summary
-          {' '}
-        </h2>
-        <p>
-          {`${summary}`}
-        </p>
-      </section>
-    );
-  }
+  static renderSummary({ summary }) {}
 
   constructor(props) {

[Survived] StringLiteral
sd-06-project-react-testing-library/src/components/PokemonDetails.js:30:12
     return (
       <section>
         <h2>
-          {' '}
+          {""}
           Summary
           {' '}

[Survived] BlockStatement
sd-06-project-react-testing-library/src/components/PokemonDetails.js:41:22
     );
   }
 
-  constructor(props) {
-    super(props);
-
-    this.renderFavoriteInput = this.renderFavoriteInput.bind(this);
-  }
+  constructor(props) {}
 
   findPokemon(givenId) {

[Survived] BlockStatement
sd-06-project-react-testing-library/src/components/PokemonDetails.js:47:24
     this.renderFavoriteInput = this.renderFavoriteInput.bind(this);
   }
 
-  findPokemon(givenId) {
-    const { pokemons } = this.props;
-
-    return pokemons.find(({ id }) => id === givenId);
-  }
+  findPokemon(givenId) {}
 
   renderFavoriteInput(pokemonId, isFavorite) {

[Survived] ConditionalExpression
sd-06-project-react-testing-library/src/components/PokemonDetails.js:50:38
   findPokemon(givenId) {
     const { pokemons } = this.props;
 
-    return pokemons.find(({ id }) => id === givenId);
+    return pokemons.find(({ id }) => false);
   }
 

[Survived] ConditionalExpression
sd-06-project-react-testing-library/src/components/PokemonDetails.js:50:38
   findPokemon(givenId) {
     const { pokemons } = this.props;
 
-    return pokemons.find(({ id }) => id === givenId);
+    return pokemons.find(({ id }) => true);
   }
 

[Survived] BlockStatement
sd-06-project-react-testing-library/src/components/PokemonDetails.js:53:46
     return pokemons.find(({ id }) => id === givenId);
   }
 
-  renderFavoriteInput(pokemonId, isFavorite) {
-    const { onUpdateFavoritePokemons } = this.props;
-
-    return (
-      <form className="favorite-form">
-        <label htmlFor="favorite">
-          Pokémon favoritado?
-          <input
-            type="checkbox"
-            id="favorite"
-            checked={ isFavorite }
-            onChange={
-              ({ target: { checked } }) => onUpdateFavoritePokemons(pokemonId, checked)
-            }
-          />
-        </label>
-      </form>
-    );
-  }
+  renderFavoriteInput(pokemonId, isFavorite) {}
 
   render() {

[Survived] ArrowFunction
sd-06-project-react-testing-library/src/components/PokemonDetails.js:65:15
             id="favorite"
             checked={ isFavorite }
             onChange={
-              ({ target: { checked } }) => onUpdateFavoritePokemons(pokemonId, checked)
+              () => undefined
             }
           />

[Survived] BlockStatement
sd-06-project-react-testing-library/src/components/PokemonDetails.js:73:12
     );
   }
 
-  render() {
-    const { renderHabitat, renderSummary } = PokemonDetails;
-    const { renderFavoriteInput } = this;
-    const {
-      match: { params: { id } },
-      isPokemonFavoriteById,
-    } = this.props;
-
-    const pokemon = this.findPokemon(parseInt(id, 10));
-    const isFavorite = isPokemonFavoriteById[id];
-
-    return (
-      <section className="pokemon-details">
-        <h2>{`${pokemon.name} Details`}</h2>
-        <Pokemon
-          pokemon={ pokemon }
-          showDetailsLink={ false }
-          isFavorite={ isFavorite }
-        />
-        {renderSummary(pokemon)}
-        {renderHabitat(pokemon)}
-        {renderFavoriteInput(pokemon.id, isFavorite)}
-      </section>
-    );
-  }
+  render() {}
 }
 

[Survived] BooleanLiteral
sd-06-project-react-testing-library/src/components/PokemonDetails.js:89:29
         <h2>{`${pokemon.name} Details`}</h2>
         <Pokemon
           pokemon={ pokemon }
-          showDetailsLink={ false }
+          showDetailsLink={ true }
           isFavorite={ isFavorite }
         />

[Survived] ObjectLiteral
sd-06-project-react-testing-library/src/components/PokemonDetails.js:100:28
   }
 }
 
-PokemonDetails.propTypes = {
-  isPokemonFavoriteById: isPokemonFavoriteByIdType.isRequired,
-  match: PropTypes.shape({
-    params: PropTypes.shape({
-      id: PropTypes.string.isRequired,
-    }).isRequired,
-  }).isRequired,
-  onUpdateFavoritePokemons: PropTypes.func.isRequired,
-  pokemons: PropTypes.arrayOf(pokemonType.isRequired).isRequired,
-};
+PokemonDetails.propTypes = {};
 
 export default PokemonDetails;
