[Survived] StringLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:5:11
   {
     id: 25,
     name: 'Pikachu',
-    type: 'Electric',
+    type: "",
     averageWeight: {
       value: '6.0',

[Survived] ObjectLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:6:20
     id: 25,
     name: 'Pikachu',
     type: 'Electric',
-    averageWeight: {
-      value: '6.0',
-      measurementUnit: 'kg',
-    },
+    averageWeight: {},
     image: 'https://cdn.bulbagarden.net/upload/b/b2/Spr_5b_025_m.png',
     moreInfo: 'https://bulbapedia.bulbagarden.net/wiki/Pikachu_(Pok%C3%A9mon)',

[Survived] ArrayDeclaration
Trybe/sd-06-project-react-testing-library/src/data.js:12:14
     },
     image: 'https://cdn.bulbagarden.net/upload/b/b2/Spr_5b_025_m.png',
     moreInfo: 'https://bulbapedia.bulbagarden.net/wiki/Pikachu_(Pok%C3%A9mon)',
-    foundAt: [
-      {
-        location: 'Kanto Viridian Forest',
-        map: 'https://cdn.bulbagarden.net/upload/0/08/Kanto_Route_2_Map.png',
-      },
-      {
-        location: 'Kanto Power Plant',
-        map: 'https://cdn.bulbagarden.net/upload/b/bd/Kanto_Celadon_City_Map.png',
-      },
-    ],
+    foundAt: [],
     summary: 'This intelligent Pokémon roasts hard berries with electricity to make them tender enough to eat.',
   },

[Survived] StringLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:18:19
         map: 'https://cdn.bulbagarden.net/upload/0/08/Kanto_Route_2_Map.png',
       },
       {
-        location: 'Kanto Power Plant',
+        location: "",
         map: 'https://cdn.bulbagarden.net/upload/b/bd/Kanto_Celadon_City_Map.png',
       },

[Survived] StringLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:19:14
       },
       {
         location: 'Kanto Power Plant',
-        map: 'https://cdn.bulbagarden.net/upload/b/bd/Kanto_Celadon_City_Map.png',
+        map: "",
       },
     ],

[Survived] StringLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:27:11
   {
     id: 4,
     name: 'Charmander',
-    type: 'Fire',
+    type: "",
     averageWeight: {
       value: '8.5',

[Survived] StringLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:29:14
     name: 'Charmander',
     type: 'Fire',
     averageWeight: {
-      value: '8.5',
+      value: "",
       measurementUnit: 'kg',
     },

[Survived] StringLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:30:24
     type: 'Fire',
     averageWeight: {
       value: '8.5',
-      measurementUnit: 'kg',
+      measurementUnit: "",
     },
     image: 'https://cdn.bulbagarden.net/upload/0/0a/Spr_5b_004.png',

[Survived] ArrayDeclaration
Trybe/sd-06-project-react-testing-library/src/data.js:34:14
     },
     image: 'https://cdn.bulbagarden.net/upload/0/0a/Spr_5b_004.png',
     moreInfo: 'https://bulbapedia.bulbagarden.net/wiki/Charmander_(Pok%C3%A9mon)',
-    foundAt: [
-      {
-        location: 'Alola Route 3',
-        map: 'https://cdn.bulbagarden.net/upload/9/93/Alola_Route_3_Map.png',
-      },
-      {
-        location: 'Kanto Route 3',
-        map: 'https://cdn.bulbagarden.net/upload/4/4a/Kanto_Route_3_Map.png',
-      },
-      {
-        location: 'Kanto Route 4',
-        map: 'https://cdn.bulbagarden.net/upload/2/24/Kanto_Route_4_Map.png',
-      },
-      {
-        location: 'Kanto Rock Tunnel',
-        map: 'https://cdn.bulbagarden.net/upload/6/6f/Kanto_Rock_Tunnel_Map.png',
-      },
-    ],
+    foundAt: [],
     summary: 'The flame on its tail shows the strength of its life force. If it is weak, the flame also burns weakly.',
   },

[Survived] StringLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:37:14
     foundAt: [
       {
         location: 'Alola Route 3',
-        map: 'https://cdn.bulbagarden.net/upload/9/93/Alola_Route_3_Map.png',
+        map: "",
       },
       {

[Survived] StringLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:52:14
         map: 'https://cdn.bulbagarden.net/upload/6/6f/Kanto_Rock_Tunnel_Map.png',
       },
     ],
-    summary: 'The flame on its tail shows the strength of its life force. If it is weak, the flame also burns weakly.',
+    summary: "",
   },
   {

[Survived] StringLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:56:11
   },
   {
     id: 10,
-    name: 'Caterpie',
+    name: "",
     type: 'Bug',
     averageWeight: {

[Survived] StringLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:60:24
     type: 'Bug',
     averageWeight: {
       value: '2.9',
-      measurementUnit: 'kg',
+      measurementUnit: "",
     },
     image: 'https://cdn.bulbagarden.net/upload/8/83/Spr_5b_010.png',

[Survived] StringLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:63:15
       measurementUnit: 'kg',
     },
     image: 'https://cdn.bulbagarden.net/upload/8/83/Spr_5b_010.png',
-    moreInfo: 'https://bulbapedia.bulbagarden.net/wiki/Caterpie_(Pok%C3%A9mon)',
+    moreInfo: "",
     foundAt: [
       {

[Survived] ObjectLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:65:7
     image: 'https://cdn.bulbagarden.net/upload/8/83/Spr_5b_010.png',
     moreInfo: 'https://bulbapedia.bulbagarden.net/wiki/Caterpie_(Pok%C3%A9mon)',
     foundAt: [
-      {
-        location: 'Johto Route 30',
-        map: 'https://cdn.bulbagarden.net/upload/7/76/Johto_Route_30_Map.png',
-      },
+      {},
       {
         location: 'Johto Route 31',

[Survived] StringLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:74:19
         map: 'https://cdn.bulbagarden.net/upload/2/2b/Johto_Route_31_Map.png',
       },
       {
-        location: 'Ilex Forest',
+        location: "",
         map: 'https://cdn.bulbagarden.net/upload/a/ae/Johto_Ilex_Forest_Map.png',
       },

[Survived] ObjectLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:77:7
         location: 'Ilex Forest',
         map: 'https://cdn.bulbagarden.net/upload/a/ae/Johto_Ilex_Forest_Map.png',
       },
-      {
-        location: 'Johto National Park',
-        map: 'https://cdn.bulbagarden.net/upload/4/4e/Johto_National_Park_Map.png',
-      },
+      {},
     ],
     summary: 'For protection, it releases a horrible stench from the antennae on its head to drive away enemies.',

[Survived] StringLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:87:11
   {
     id: 23,
     name: 'Ekans',
-    type: 'Poison',
+    type: "",
     averageWeight: {
       value: '6.9',

[Survived] StringLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:90:24
     type: 'Poison',
     averageWeight: {
       value: '6.9',
-      measurementUnit: 'kg',
+      measurementUnit: "",
     },
     image: 'https://cdn.bulbagarden.net/upload/1/18/Spr_5b_023.png',

[Survived] ObjectLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:102:3
     ],
     summary: 'It can freely detach its jaw to swallow large prey whole. It can become too heavy to move, however.',
   },
-  {
-    id: 65,
-    name: 'Alakazam',
-    type: 'Psychic',
-    averageWeight: {
-      value: '48.0',
-      measurementUnit: 'kg',
-    },
-    image: 'https://cdn.bulbagarden.net/upload/8/88/Spr_5b_065_m.png',
-    moreInfo: 'https://bulbapedia.bulbagarden.net/wiki/Alakazam_(Pok%C3%A9mon)',
-    foundAt: [
-      {
-        location: 'Unova Accumula Town',
-        map: 'https://cdn.bulbagarden.net/upload/4/44/Unova_Accumula_Town_Map.png',
-      },
-    ],
-    summary: 'Closing both its eyes heightens all its other senses. This enables it to use its abilities to their extremes.',
-  },
+  {},
   {
     id: 151,

[Survived] StringLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:107:14
     name: 'Alakazam',
     type: 'Psychic',
     averageWeight: {
-      value: '48.0',
+      value: "",
       measurementUnit: 'kg',
     },

[Survived] StringLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:108:24
     type: 'Psychic',
     averageWeight: {
       value: '48.0',
-      measurementUnit: 'kg',
+      measurementUnit: "",
     },
     image: 'https://cdn.bulbagarden.net/upload/8/88/Spr_5b_065_m.png',

[Survived] StringLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:115:14
     foundAt: [
       {
         location: 'Unova Accumula Town',
-        map: 'https://cdn.bulbagarden.net/upload/4/44/Unova_Accumula_Town_Map.png',
+        map: "",
       },
     ],

[Survived] StringLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:118:14
         map: 'https://cdn.bulbagarden.net/upload/4/44/Unova_Accumula_Town_Map.png',
       },
     ],
-    summary: 'Closing both its eyes heightens all its other senses. This enables it to use its abilities to their extremes.',
+    summary: "",
   },
   {

[Survived] ObjectLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:120:3
     ],
     summary: 'Closing both its eyes heightens all its other senses. This enables it to use its abilities to their extremes.',
   },
-  {
-    id: 151,
-    name: 'Mew',
-    type: 'Psychic',
-    averageWeight: {
-      value: '4.0',
-      measurementUnit: 'kg',
-    },
-    image: 'https://cdn.bulbagarden.net/upload/4/43/Spr_5b_151.png',
-    moreInfo: 'https://bulbapedia.bulbagarden.net/wiki/Mew_(Pok%C3%A9mon)',
-    foundAt: [
-      {
-        location: 'Faraway Island',
-        map: 'https://cdn.bulbagarden.net/upload/e/e4/Hoenn_Faraway_Island_Map.png',
-      },
-    ],
-    summary: 'Apparently, it appears only to those people who are pure of heart and have a strong desire to see it.',
-  },
+  {},
   {
     id: 78,

[Survived] StringLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:122:11
   },
   {
     id: 151,
-    name: 'Mew',
+    name: "",
     type: 'Psychic',
     averageWeight: {

[Survived] StringLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:128:12
       value: '4.0',
       measurementUnit: 'kg',
     },
-    image: 'https://cdn.bulbagarden.net/upload/4/43/Spr_5b_151.png',
+    image: "",
     moreInfo: 'https://bulbapedia.bulbagarden.net/wiki/Mew_(Pok%C3%A9mon)',
     foundAt: [

[Survived] ArrayDeclaration
Trybe/sd-06-project-react-testing-library/src/data.js:130:14
     },
     image: 'https://cdn.bulbagarden.net/upload/4/43/Spr_5b_151.png',
     moreInfo: 'https://bulbapedia.bulbagarden.net/wiki/Mew_(Pok%C3%A9mon)',
-    foundAt: [
-      {
-        location: 'Faraway Island',
-        map: 'https://cdn.bulbagarden.net/upload/e/e4/Hoenn_Faraway_Island_Map.png',
-      },
-    ],
+    foundAt: [],
     summary: 'Apparently, it appears only to those people who are pure of heart and have a strong desire to see it.',
   },

[Survived] StringLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:136:14
         map: 'https://cdn.bulbagarden.net/upload/e/e4/Hoenn_Faraway_Island_Map.png',
       },
     ],
-    summary: 'Apparently, it appears only to those people who are pure of heart and have a strong desire to see it.',
+    summary: "",
   },
   {

[Survived] StringLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:140:11
   },
   {
     id: 78,
-    name: 'Rapidash',
+    name: "",
     type: 'Fire',
     averageWeight: {

[Survived] ObjectLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:142:20
     id: 78,
     name: 'Rapidash',
     type: 'Fire',
-    averageWeight: {
-      value: '95.0',
-      measurementUnit: 'kg',
-    },
+    averageWeight: {},
     image: 'https://cdn.bulbagarden.net/upload/5/58/Spr_5b_078.png',
     moreInfo: 'https://bulbapedia.bulbagarden.net/wiki/Rapidash_(Pok%C3%A9mon)',

[Survived] StringLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:143:14
     name: 'Rapidash',
     type: 'Fire',
     averageWeight: {
-      value: '95.0',
+      value: "",
       measurementUnit: 'kg',
     },

[Survived] ArrayDeclaration
Trybe/sd-06-project-react-testing-library/src/data.js:148:14
     },
     image: 'https://cdn.bulbagarden.net/upload/5/58/Spr_5b_078.png',
     moreInfo: 'https://bulbapedia.bulbagarden.net/wiki/Rapidash_(Pok%C3%A9mon)',
-    foundAt: [
-      {
-        location: 'Kanto Route 28',
-        map: 'https://cdn.bulbagarden.net/upload/5/5b/Kanto_Route_28_Map.png',
-      },
-      {
-        location: 'Johto Mount Silver',
-        map: 'https://cdn.bulbagarden.net/upload/9/95/Johto_Mt_Silver_Map.png',
-      },
-    ],
+    foundAt: [],
     summary: 'At full gallop, its four hooves barely touch the ground because it moves so incredibly fast.',
   },

[Survived] ObjectLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:149:7
     image: 'https://cdn.bulbagarden.net/upload/5/58/Spr_5b_078.png',
     moreInfo: 'https://bulbapedia.bulbagarden.net/wiki/Rapidash_(Pok%C3%A9mon)',
     foundAt: [
-      {
-        location: 'Kanto Route 28',
-        map: 'https://cdn.bulbagarden.net/upload/5/5b/Kanto_Route_28_Map.png',
-      },
+      {},
       {
         location: 'Johto Mount Silver',

[Survived] StringLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:151:14
     foundAt: [
       {
         location: 'Kanto Route 28',
-        map: 'https://cdn.bulbagarden.net/upload/5/5b/Kanto_Route_28_Map.png',
+        map: "",
       },
       {

[Survived] ObjectLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:153:7
         location: 'Kanto Route 28',
         map: 'https://cdn.bulbagarden.net/upload/5/5b/Kanto_Route_28_Map.png',
       },
-      {
-        location: 'Johto Mount Silver',
-        map: 'https://cdn.bulbagarden.net/upload/9/95/Johto_Mt_Silver_Map.png',
-      },
+      {},
     ],
     summary: 'At full gallop, its four hooves barely touch the ground because it moves so incredibly fast.',

[Survived] StringLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:155:14
       },
       {
         location: 'Johto Mount Silver',
-        map: 'https://cdn.bulbagarden.net/upload/9/95/Johto_Mt_Silver_Map.png',
+        map: "",
       },
     ],

[Survived] StringLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:158:14
         map: 'https://cdn.bulbagarden.net/upload/9/95/Johto_Mt_Silver_Map.png',
       },
     ],
-    summary: 'At full gallop, its four hooves barely touch the ground because it moves so incredibly fast.',
+    summary: "",
   },
   {

[Survived] StringLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:165:14
     name: 'Snorlax',
     type: 'Normal',
     averageWeight: {
-      value: '460.0',
+      value: "",
       measurementUnit: 'kg',
     },

[Survived] StringLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:166:24
     type: 'Normal',
     averageWeight: {
       value: '460.0',
-      measurementUnit: 'kg',
+      measurementUnit: "",
     },
     image: 'https://cdn.bulbagarden.net/upload/4/40/Spr_5b_143.png',

[Survived] StringLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:169:15
       measurementUnit: 'kg',
     },
     image: 'https://cdn.bulbagarden.net/upload/4/40/Spr_5b_143.png',
-    moreInfo: 'https://bulbapedia.bulbagarden.net/wiki/Snorlax_(Pok%C3%A9mon)',
+    moreInfo: "",
     foundAt: [
       {

[Survived] ArrayDeclaration
Trybe/sd-06-project-react-testing-library/src/data.js:170:14
     },
     image: 'https://cdn.bulbagarden.net/upload/4/40/Spr_5b_143.png',
     moreInfo: 'https://bulbapedia.bulbagarden.net/wiki/Snorlax_(Pok%C3%A9mon)',
-    foundAt: [
-      {
-        location: 'Kanto Vermillion City',
-        map: 'https://cdn.bulbagarden.net/upload/5/54/Kanto_Vermilion_City_Map.png',
-      },
-    ],
+    foundAt: [],
     summary: 'What sounds like its cry may actually be its snores or the rumblings of its hungry belly.',
   },

[Survived] StringLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:173:14
     foundAt: [
       {
         location: 'Kanto Vermillion City',
-        map: 'https://cdn.bulbagarden.net/upload/5/54/Kanto_Vermilion_City_Map.png',
+        map: "",
       },
     ],

[Survived] StringLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:181:11
   {
     id: 148,
     name: 'Dragonair',
-    type: 'Dragon',
+    type: "",
     averageWeight: {
       value: '16.5',

[Survived] ObjectLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:182:20
     id: 148,
     name: 'Dragonair',
     type: 'Dragon',
-    averageWeight: {
-      value: '16.5',
-      measurementUnit: 'kg',
-    },
+    averageWeight: {},
     image: 'https://cdn.bulbagarden.net/upload/2/2c/Spr_5b_148.png',
     moreInfo: 'https://bulbapedia.bulbagarden.net/wiki/Dragonair_(Pok%C3%A9mon)',

[Survived] StringLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:186:12
       value: '16.5',
       measurementUnit: 'kg',
     },
-    image: 'https://cdn.bulbagarden.net/upload/2/2c/Spr_5b_148.png',
+    image: "",
     moreInfo: 'https://bulbapedia.bulbagarden.net/wiki/Dragonair_(Pok%C3%A9mon)',
     foundAt: [

[Survived] StringLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:191:14
     foundAt: [
       {
         location: 'Johto Route 45',
-        map: 'https://cdn.bulbagarden.net/upload/2/21/Johto_Route_45_Map.png',
+        map: "",
       },
       {

[Survived] ObjectLiteral
Trybe/sd-06-project-react-testing-library/src/data.js:193:7
         location: 'Johto Route 45',
         map: 'https://cdn.bulbagarden.net/upload/2/21/Johto_Route_45_Map.png',
       },
-      {
-        location: 'Johto Dragon\'s Den',
-        map: 'https://cdn.bulbagarden.net/upload/1/1e/Johto_Dragons_Den_Map.png',
-      },
+      {},
     ],
     summary: 'They say that if it emits an aura from its whole body, the weather will begin to change instantly.',
