[Survived] StringLiteral
Trybe/sd-06-project-react-testing-library/src/index.js:12:27
   <BrowserRouter>
     <App />
   </BrowserRouter>,
-  document.getElementById('root'),
+  document.getElementById(""),
 );
 
