[Survived] LogicalOperator
Trybe/sd-06-project-react-testing-library/src/serviceWorker.js:14:3
 // opt-in, read https://bit.ly/CRA-PWA
 
 const isLocalhost = Boolean(
-  window.location.hostname === 'localhost' ||
-    // [::1] is the IPv6 localhost address.
-    window.location.hostname === '[::1]' ||
+  window.location.hostname === 'localhost' && // [::1] is the IPv6 localhost address.
+window.location.hostname === '[::1]' ||
     // 127.0.0.0/8 are considered localhost for IPv4.
     window.location.hostname.match(

[Survived] ConditionalExpression
Trybe/sd-06-project-react-testing-library/src/serviceWorker.js:16:5
 const isLocalhost = Boolean(
   window.location.hostname === 'localhost' ||
     // [::1] is the IPv6 localhost address.
-    window.location.hostname === '[::1]' ||
+    false ||
     // 127.0.0.0/8 are considered localhost for IPv4.
     window.location.hostname.match(

[Survived] ConditionalExpression
Trybe/sd-06-project-react-testing-library/src/serviceWorker.js:24:7
 );
 
 export function register(config) {
-  if (process.env.NODE_ENV === 'production' && 'serviceWorker' in navigator) {
+  if (false) {
     // The URL constructor is available in all browsers that support SW.
     const publicUrl = new URL(process.env.PUBLIC_URL, window.location.href);

[Survived] ConditionalExpression
Trybe/sd-06-project-react-testing-library/src/serviceWorker.js:24:7
 );
 
 export function register(config) {
-  if (process.env.NODE_ENV === 'production' && 'serviceWorker' in navigator) {
+  if (false && 'serviceWorker' in navigator) {
     // The URL constructor is available in all browsers that support SW.
     const publicUrl = new URL(process.env.PUBLIC_URL, window.location.href);

[Survived] BlockStatement
Trybe/sd-06-project-react-testing-library/src/serviceWorker.js:27:54
   if (process.env.NODE_ENV === 'production' && 'serviceWorker' in navigator) {
     // The URL constructor is available in all browsers that support SW.
     const publicUrl = new URL(process.env.PUBLIC_URL, window.location.href);
-    if (publicUrl.origin !== window.location.origin) {
-      // Our service worker won't work if PUBLIC_URL is on a different origin
-      // from what our page is served on. This might happen if a CDN is used to
-      // serve assets; see https://github.com/facebook/create-react-app/issues/2374
-      return;
-    }
+    if (publicUrl.origin !== window.location.origin) {}
 
     window.addEventListener('load', () => {

[Survived] ConditionalExpression
Trybe/sd-06-project-react-testing-library/src/serviceWorker.js:63:13
     .then(registration => {
       registration.onupdatefound = () => {
         const installingWorker = registration.installing;
-        if (installingWorker == null) {
+        if (false) {
           return;
         }

[Survived] BlockStatement
Trybe/sd-06-project-react-testing-library/src/serviceWorker.js:63:39
     .then(registration => {
       registration.onupdatefound = () => {
         const installingWorker = registration.installing;
-        if (installingWorker == null) {
-          return;
-        }
+        if (installingWorker == null) {}
         installingWorker.onstatechange = () => {
           if (installingWorker.state === 'installed') {

[Survived] ConditionalExpression
Trybe/sd-06-project-react-testing-library/src/serviceWorker.js:68:17
         }
         installingWorker.onstatechange = () => {
           if (installingWorker.state === 'installed') {
-            if (navigator.serviceWorker.controller) {
+            if (false) {
               // At this point, the updated precached content has been fetched,
               // but the previous service worker will still serve the older

[Survived] LogicalOperator
Trybe/sd-06-project-react-testing-library/src/serviceWorker.js:78:19
               );
 
               // Execute callback
-              if (config && config.onUpdate) {
+              if (config || config.onUpdate) {
                 config.onUpdate(registration);
               }

[Survived] ConditionalExpression
Trybe/sd-06-project-react-testing-library/src/serviceWorker.js:88:19
               console.log('Content is cached for offline use.');
 
               // Execute callback
-              if (config && config.onSuccess) {
+              if (true) {
                 config.onSuccess(registration);
               }

[Survived] StringLiteral
Trybe/sd-06-project-react-testing-library/src/serviceWorker.js:97:21
       };
     })
     .catch(error => {
-      console.error('Error during service worker registration:', error);
+      console.error("", error);
     });
 }

[Survived] StringLiteral
Trybe/sd-06-project-react-testing-library/src/serviceWorker.js:104:34
 function checkValidServiceWorker(swUrl, config) {
   // Check if the service worker can be found. If it can't reload the page.
   fetch(swUrl, {
-    headers: { 'Service-Worker': 'script' }
+    headers: { 'Service-Worker': "" }
   })
     .then(response => {

[Survived] ObjectLiteral
Trybe/sd-06-project-react-testing-library/src/serviceWorker.js:104:14
 function checkValidServiceWorker(swUrl, config) {
   // Check if the service worker can be found. If it can't reload the page.
   fetch(swUrl, {
-    headers: { 'Service-Worker': 'script' }
+    headers: {}
   })
     .then(response => {

[Survived] BlockStatement
Trybe/sd-06-project-react-testing-library/src/serviceWorker.js:106:23
   fetch(swUrl, {
     headers: { 'Service-Worker': 'script' }
   })
-    .then(response => {
-      // Ensure service worker exists, and that we really are getting a JS file.
-      const contentType = response.headers.get('content-type');
-      if (
-        response.status === 404 ||
-        (contentType != null && contentType.indexOf('javascript') === -1)
-      ) {
-        // No service worker found. Probably a different app. Reload the page.
-        navigator.serviceWorker.ready.then(registration => {
-          registration.unregister().then(() => {
-            window.location.reload();
-          });
-        });
-      } else {
-        // Service worker found. Proceed as normal.
-        registerValidSW(swUrl, config);
-      }
-    })
+    .then(response => {})
     .catch(() => {
       console.log(

[Survived] BlockStatement
Trybe/sd-06-project-react-testing-library/src/serviceWorker.js:132:37
 }
 
 export function unregister() {
-  if ('serviceWorker' in navigator) {
-    navigator.serviceWorker.ready.then(registration => {
-      registration.unregister();
-    });
-  }
+  if ('serviceWorker' in navigator) {}
 }
 
