[Killed] ArrowFunction
sd-06-project-react-testing-library/src/services/pokedexService.js:1:39
-export const readFavoritePokemonIds = () => (
-  JSON.parse(localStorage.getItem('favoritePokemonIds')) || []
-);
+export const readFavoritePokemonIds = () => undefined;
 
 const saveFavoritePokemons = (pokemons) => (

[Killed] ConditionalExpression
sd-06-project-react-testing-library/src/services/pokedexService.js:2:3
 export const readFavoritePokemonIds = () => (
-  JSON.parse(localStorage.getItem('favoritePokemonIds')) || []
+  false
 );
 

[Killed] LogicalOperator
sd-06-project-react-testing-library/src/services/pokedexService.js:2:3
 export const readFavoritePokemonIds = () => (
-  JSON.parse(localStorage.getItem('favoritePokemonIds')) || []
+  JSON.parse(localStorage.getItem('favoritePokemonIds')) && []
 );
 

[Survived] ArrowFunction
sd-06-project-react-testing-library/src/services/pokedexService.js:5:30
   JSON.parse(localStorage.getItem('favoritePokemonIds')) || []
 );
 
-const saveFavoritePokemons = (pokemons) => (
-  localStorage.setItem('favoritePokemonIds', JSON.stringify(pokemons))
-);
+const saveFavoritePokemons = () => undefined;
 
 const addPokemonToFavorites = (pokemonId) => {

[Survived] StringLiteral
sd-06-project-react-testing-library/src/services/pokedexService.js:6:24
 );
 
 const saveFavoritePokemons = (pokemons) => (
-  localStorage.setItem('favoritePokemonIds', JSON.stringify(pokemons))
+  localStorage.setItem("", JSON.stringify(pokemons))
 );
 

[Survived] BlockStatement
sd-06-project-react-testing-library/src/services/pokedexService.js:9:46
   localStorage.setItem('favoritePokemonIds', JSON.stringify(pokemons))
 );
 
-const addPokemonToFavorites = (pokemonId) => {
-  const favoritePokemons = readFavoritePokemonIds();
-  const newFavoritePokemons = [...favoritePokemons, pokemonId];
-
-  saveFavoritePokemons(newFavoritePokemons);
-};
+const addPokemonToFavorites = (pokemonId) => {};
 
 const removePokemonFromFavorites = (pokemonId) => {

[Survived] ArrayDeclaration
sd-06-project-react-testing-library/src/services/pokedexService.js:11:31
 
 const addPokemonToFavorites = (pokemonId) => {
   const favoritePokemons = readFavoritePokemonIds();
-  const newFavoritePokemons = [...favoritePokemons, pokemonId];
+  const newFavoritePokemons = [];
 
   saveFavoritePokemons(newFavoritePokemons);

[Survived] BlockStatement
sd-06-project-react-testing-library/src/services/pokedexService.js:16:51
   saveFavoritePokemons(newFavoritePokemons);
 };
 
-const removePokemonFromFavorites = (pokemonId) => {
-  const favoritePokemons = readFavoritePokemonIds();
-  const newFavoritePokemons = favoritePokemons.filter((id) => id !== pokemonId);
-
-  saveFavoritePokemons(newFavoritePokemons);
-};
+const removePokemonFromFavorites = (pokemonId) => {};
 
 export const updateFavoritePokemons = (pokemonId, isFavorite) => (

[Survived] ConditionalExpression
sd-06-project-react-testing-library/src/services/pokedexService.js:18:63
 
 const removePokemonFromFavorites = (pokemonId) => {
   const favoritePokemons = readFavoritePokemonIds();
-  const newFavoritePokemons = favoritePokemons.filter((id) => id !== pokemonId);
+  const newFavoritePokemons = favoritePokemons.filter((id) => false);
 
   saveFavoritePokemons(newFavoritePokemons);

[Survived] ArrowFunction
sd-06-project-react-testing-library/src/services/pokedexService.js:18:55
 
 const removePokemonFromFavorites = (pokemonId) => {
   const favoritePokemons = readFavoritePokemonIds();
-  const newFavoritePokemons = favoritePokemons.filter((id) => id !== pokemonId);
+  const newFavoritePokemons = favoritePokemons.filter(() => undefined);
 
   saveFavoritePokemons(newFavoritePokemons);

[Survived] ArrowFunction
sd-06-project-react-testing-library/src/services/pokedexService.js:23:39
   saveFavoritePokemons(newFavoritePokemons);
 };
 
-export const updateFavoritePokemons = (pokemonId, isFavorite) => (
-  isFavorite ? addPokemonToFavorites(pokemonId) : removePokemonFromFavorites(pokemonId)
-);
+export const updateFavoritePokemons = () => undefined;
 
