[Survived] ObjectLiteral
sd-06-project-react-testing-library/src/types/index.js:17:26
     measurementUnit: string,
     value: string,
   }),
-  foundAt: arrayOf(shape({
-    location: string,
-    map: string,
-  })),
+  foundAt: arrayOf(shape({})),
   id: number,
   image: string,
